Revit 2027 API
HVACLoadBuildingType.IsNameUnique(String) Method
 Determines whether a potential building type name is unique.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsNameUnique(
	string name
)
Public Function IsNameUnique (
	name As String
) As Boolean
public:
bool IsNameUnique(
	String^ name
)
member IsNameUnique :
        name : string -> bool
Parameters
name String
 The candidate name.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HVACLoadBuildingType Class
IsNameUnique Overload
Autodesk.Revit.DB.Analysis Namespace